//COMPHN   JOB (001),'COMPILE HN EXTRACTOR',NOTIFY=&SYSUID
//COMPILE  EXEC IGYWCL
//COBOL.SYSIN   DD DSN=&SYSUID..CBL(GETHN),DISP=SHR
//LKED.SYSLMOD  DD DSN=&SYSUID..LOAD(GETHN),DISP=SHR