//GETHN    JOB (001),'GET DATA FROM HN VSAM',MSGCLASS=A,CLASS=A,
//         MSGLEVEL=(1,1),REGION=0M,NOTIFY=&SYSUID.
//RUN     EXEC PGM=GETHN,PARM='&PARAMS'
//RESULT   DD DUMMY
//DATA     DD DUMMY
//SYSOUT   DD SYSOUT=*,OUTLIM=15000
//SYSUDUMP DD DUMMY