//GETHN    JOB (001),'GET DATA FROM HN',
//         MSGLEVEL=(1,1),NOTIFY=&SYSUID
//RUN      EXEC PGM=GETHN,PARM=&PARAMS
//STEPLIB  DD DSN=&SYSUID..LOAD,DISP=SHR
//RESULT   DD SYSOUT=*
//CLSTER   DD DSN=&SYSUID..HN.CLSTER,DISP=SHARE
//SYSOUT   DD SYSOUT=*,OUTLIM=15000
//SYSUDUMP DD DUMMY