       IDENTIFICATION DIVISION. 
       PROGRAM-ID. GETHN.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT JSON-FD ASSIGN TO A ACCESS MODE IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD JSON-FD.
       01 A PIC X(1000).
       WORKING-STORAGE SECTION.
       01  JSON-RETORN.
           05 TYPE-INFO      PIC X(4).
           05 TOTAL-KARMA    PIC 9(10).
           05 TOTAL-COMMENT  PIC 9(12).
           05 AVG-KARMA      PIC 9(10)V99.
           05 AVG-COMMENT    PIC 9(12)V99.
       01 ERROR-JSON.
           05 TYPE-INFO PIC X(5) VALUE 'ERROR'.
           05 REASON    PIC X(25).
       01 JSON-BUFFER PIC X(1000) VALUE SPACES.
       LINKAGE SECTION.
       01 PARMDATA.
           05 STRINGLEN PIC 9(4) USAGE COMP.
           05 STRINGPARM PIC X(80).
       PROCEDURE DIVISION USING PARMDATA.
           OPEN OUTPUT JSON-FD.
           IF STRINGLEN EQUAL ZERO
              MOVE 'MUST HAVE YEAR OR MONTH' TO ERROR-JSON
              JSON GENERATE JSON-BUFFER FROM ERROR-JSON
              WRITE JSON-FD FROM JSON-BUFFER
              GOBACK
           END-IF. 
       0X0-END.
           CLOSE JSON-FD.
           GOBACK.