//PARSE    JOB 001,'PARSE HACKERNEWS',NOTIFY=&SYSUID
//COMPILE EXEC IGYWCL
//COBOL.SYSIN   DD DSN=&SYSUID..CBL(PARSECSV),DISP=SHR
//LKED.SYSLMOD  DD DSN=&SYSUID..LOAD(PARSECSV),DISP=SHR
//****************************************************//
// IF RC = 0 THEN
//RUN      EXEC PGM=PARSECSV
//STEPLIB  DD DSN=&SYSUID..LOAD,DISP=SHR
//CSV      DD DSN=&SYSUID..HNCSV,DISP=SHR
//CLSTER   DD DSN=&SYSUID..HN.CLSTER,DISP=SHR
//SYSOUT   DD SYSOUT=*,OUTLIM=15000
//SYSDUMP  DD SYSOUT=*,OUTLIM=15000
// ELSE
// ENDIF