//PARSE    JOB 001,'PARSE HACKERNEWS',NOTIFY=&SYSUID
//COMPILE EXEC IGYWCL
//COB.SYSIN    DD DSN=&SYSUID..SRC(PARSECSV),DISP=SHR 
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(PARSECSV),DISP=SHR
// IF RC = 0 THEN
//RUN     EXEC PGM=PARSECSV
//CSV      DD DUMMY
//CLSTER   DD DUMMY
//SYSOUT   DD SYSOUT=*,OUTLIM=15000
//SYSUDUMP DD DUMMY
// ELSE
// ENDIF